Repository: pfaivre/mdp
Catalog: locale/*/LC_MESSAGES/mdp.po
Languages: fr

source: Loaded libraries:
fr: Bibliothèques chargées :

source: MISSING
fr: MANQUANT

source: This program can store your passwords on an encrypted file and allows you to access it in a very simple way.
fr: Ce programme vous permet de stocker vos mots de passe dans un fichier chiffré et d'y accéder très facilement.

source: This program is fully interactive. You can also use one of these commands:
fr: Ce programme est entièrement interactif. Vous pouvez également utiliser ces paramètres :

source: -h, --help Shows this help and exits
fr: -h, --help Affiche ce message et se ferme

source: -v, --version Shows version information and exits
fr: -v, --version Affiche les informations de version et se ferme

source: mdp depends on these third party libraries:
fr: mdp dépend de ces bibliothèques tierces :

source: - Pyperclip, by Al Sweigart
fr: - Pyperclip, par Al Sweigart

source: - pycrypto, by Dwayne Litzenberger
fr: - pycrypto, par Dwayne Litzenberger

source: Make sure to have them installed on your system in order toaccess all the features.
fr: Assurez-vous de les avoir installé sur votre système pour profiter de toutes les fonctionnalités.

source: mdp: error: unrecognized argument: {0}
fr: mdp : Erreur : Argument inconnu : {0}

source: Failing to use the advanced interface. Switching back to the classic one.
fr: Impossible d'utiliser l'interface avancée. Chargement de l'interface de base.

source: Sorry the functionality '{0}' has not been implemented yet.
fr: Désolé, la fonctionnalité '{0}' n'a pas encore été implémentée.

source: mdp: Error: The file '{filename}' seems to becorrupted.
fr: mdp : Erreur : Le fichier '{filename}' semble corrompu.

source: Wrong password, try again.
fr: Mauvais mot de passe, veuillez réessayer.

source: Password:
fr: Mot de passe :

source: mdp: Error: Unable to decrypt the file. {error}
fr: mdp : Erreur : Impossible de déchiffrer le fichier : {error}

source: mdp: Error: Unable to parse the file. {error}
fr: mdp : Erreur : Impossible de lire le fichier : {error}

source: mdp: Error: The module pyperclip is missing
fr: mdp : Erreur : Le module pyperclip est manquant

source: mdp: Error: Unable to initialize pyperclip: {error}
fr: mdp : Erreur : Impossible d'initialiser le module pyperclip : {error}

source: {filename} is not found, it will be created.
fr: Le fichier {filename} est introuvable, un nouveau sera créé.

source: Please enter a password to protect this file.
fr: Veuillez entrer un mot de passe principal pour protéger ce fichier.

source: New password:
fr: Nouveau mot de passe :

source: The password must have at least 3 characters.
fr: Le mot de passe doit avoir au moins 3 caractères.

source: Confirm password:
fr: Confirmer le mot de passe :

source: The passwords don't match, please retry.
fr: Les mots de passe ne correspondent pas, veuillez réessayer.

source: What do you want to do? {commands} >
fr: Que voulez-vous faire ? {commands} >

source: Unknown command : '{0}'
fr: Commande inconnue : '{0}'

source: Any specific domain or login?(leave blank if not) >
fr: Un domaine ou un identifiant en particulier ? >

source: No account for theses filters.
fr: Pas de compte pour ce filtre.

source: Which one? >
fr: Lequel ? >

source: The password have been copied in the clipboard.
fr: Le mot de passe a été copié dans le presse papier.

source: Domain for the new password >
fr: Domaine pour ce compte >

source: Login for the new password >
fr: Identifiant pour ce compte >

source: Password for this account >
fr: Mot de passe pour ce compte >

source: Which ones to delete? >
fr: Lesquels supprimer ? >

source: mdp: Warning: The module pyperclip is missing. You will not be able to use the clipboard
fr: mdp : Attention : Le module pyperclip est manquant. Le programme ne sera pas en mesure de copier directement dans le presse papier.

source: mdp: Warning: Unable to initialize the pyperclip module: {error}
fr: mdp : Attention : Impossible d'initialiser le module pyperclip : {error}

source: Filter:
fr: Filtrer :

source: [+] New entry
fr: [+] Nouvelle entrée

source: Copy the password in the clipboard
fr: Copier le mot de passe dans le presse papier

source: Copy the domain in the clipboard
fr: Copier le domaine dans le presse papier

source: Copy the login in the clipboard
fr: Copier l'identifiant dans le presse papier

source: Edit this entry
fr: Modifier cette entrée

source: Delete this entry
fr: Supprimer cette entrée

source: Return
fr: Retour

source: Domain:
fr: Domaine :

source: Login:
fr: Identifiant :

source: Password
fr: Mot de passe

source: Save
fr: Enregistrer

source: Cancel
fr: Annuler
